import cls from './Footer.module.css'

export const Footer = () =>{
    return(
        <footer>
            <div className={cls.footerContent}>
                <div className={cls.footerTop}>
                    <div className={cls.footerButtonsList}>
                        <div className={cls.footerSocialButtons}>
                            <a href="" className={cls.footerBtn}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                                    <g clipPath="url(#clip0_162_330)">
                                        <path d="M15.3746 8.00003C15.373 8.65771 15.3656 9.31543 15.3566 9.97308C15.3457 10.7665 15.3335 11.5604 15.1345 12.3402C14.9258 13.158 14.5142 13.8634 13.8739 14.3855C13.1992 14.9358 12.3836 15.225 11.5034 15.2785C10.3359 15.3495 9.16788 15.3776 7.99991 15.3748C6.83191 15.3776 5.66392 15.3495 4.49645 15.2785C3.6162 15.225 2.80064 14.9358 2.1259 14.3855C1.48559 13.8634 1.07402 13.158 0.865338 12.3402C0.666338 11.5604 0.654088 10.7665 0.643245 9.97308C0.634245 9.31543 0.626775 8.65771 0.625244 8.00003C0.626775 7.34234 0.634245 6.68462 0.643245 6.02697C0.654088 5.2335 0.666338 4.43969 0.865338 3.65982C1.07402 2.84201 1.48559 2.1367 2.1259 1.61455C2.80064 1.0643 3.6162 0.775078 4.49645 0.721547C5.66392 0.650547 6.83191 0.622485 7.99991 0.625235C9.16788 0.622485 10.3359 0.650547 11.5034 0.721547C12.3836 0.775078 13.1992 1.0643 13.8739 1.61455C14.5142 2.1367 14.9258 2.84201 15.1345 3.65982C15.3335 4.43969 15.3457 5.2335 15.3566 6.02697C15.3656 6.68462 15.373 7.34234 15.3746 8.00003Z" stroke="#E6E3DA" strokeLinecap="round" strokeLinejoin="round"/>
                                        <path d="M11.25 8.00001C11.25 9.81219 9.78092 11.2812 7.96874 11.2812C6.15656 11.2812 4.6875 9.81219 4.6875 8.00001C4.6875 6.18783 6.15656 4.71877 7.96874 4.71877C9.78092 4.71877 11.25 6.18783 11.25 8.00001Z" stroke="#E6E3DA" strokeLinecap="round" strokeLinejoin="round"/>
                                        <path d="M13.25 3.78125C13.25 4.299 12.8302 4.71875 12.3125 4.71875C11.7947 4.71875 11.375 4.299 11.375 3.78125C11.375 3.2635 11.7947 2.84376 12.3125 2.84376C12.8302 2.84376 13.25 3.2635 13.25 3.78125Z" fill="#E6E3DA"/>
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_162_330">
                                        <rect width="16" height="16" fill="white"/>
                                        </clipPath>
                                    </defs>
                                </svg>
                            </a>
                            <a href="" className={cls.footerBtn}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
                                <g clipPath="url(#clip0_162_335)">
                                <path d="M8.00266 0.625043C3.92958 0.625043 0.627686 3.92694 0.627686 8.00002C0.627686 9.5803 1.12497 11.0443 1.97124 12.2446L0.877685 15.375H8.00266C12.0757 15.375 15.3776 12.0731 15.3776 8.00002C15.3776 3.92694 12.0757 0.625043 8.00266 0.625043Z" stroke="#E6E3DA" strokeLinecap="round" strokeLinejoin="round"/>
                                <path d="M10.5127 8.79512L10.1628 8.5986C9.83108 8.42666 9.57323 8.37716 9.34857 8.60136L8.65443 9.15029C8.65443 9.15029 7.90156 8.96158 7.30278 8.36395C6.70518 7.76515 6.5 7 6.5 7L7.19464 6.45151C7.41887 6.22685 7.34487 5.94442 7.19743 5.63722L7.0009 5.28736C6.86732 5.04954 6.61643 4.89937 6.34367 4.89994L6.33728 4.89996C6.13038 4.90155 5.89492 4.98596 5.68602 5.19486C5.17621 5.70469 5.09524 6.40287 5.10031 6.97659C5.10886 7.94472 5.71713 8.79764 6.35366 9.43419C6.99017 10.0707 7.85539 10.6912 8.82347 10.6997C9.39719 10.7048 10.0954 10.6198 10.6052 10.11C10.8141 9.90111 10.8985 9.66567 10.9001 9.45875L10.9001 9.45238C10.9007 9.17962 10.7505 8.9287 10.5127 8.79512Z" fill="#E6E3DA"/>
                                </g>
                                <defs>
                                <clipPath id="clip0_162_335">
                                <rect width="16" height="16" fill="white"/>
                                </clipPath>
                                </defs>
                                </svg>
                            </a>

                        </div>
                        <div className={cls.footerLogo}>
                            <p>Logo</p>
                        </div>
                        <div className={cls.footerUpBtnWrapper}>
                            <a className={cls.footerBtn}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="18" viewBox="0 0 16 18" fill="none">
                                    <path d="M8 17.1667L8 0.500082M8 0.500082L4 4.50008M8 0.500082L12 4.50008" stroke="#E6E3DA" strokeLinecap="round" strokeLinejoin="round"/>
                                </svg>
                            </a>
                        </div>
                    </div>
                    <div className={cls.footerInfoList}>
                        <div>
                            <a href="">Cкачать буклет</a>
                        </div>
                        <div>
                            <a href="tel:+77001234567">+7 700 123 45 67</a>
                            <p>г. Алматы, ул. Аль-Фараби, 128/7</p>
                            <p>Ежедневно: 08:00 – 21:00</p>
                        </div>
                        <div>
                            <a href="/contacts">Контакты</a>
                        </div>
                    </div>
                </div>
                <div className={cls.footerBottom}>
                    <div>
                        <p>Информация предоставлена с целью получения спроса потенциальных потребителей. Договоры о долевом участии заключаются после получения разрешения на привлечение денег дольщиков местным исполнительным органом согласно закона РК. Архитектура проекта, изображения благоустройства, фасадов, интерьера, применяемых материалов, их нумерация, инфраструктура комплекса являются условными и могут быть изменены в ходе проектирования, строительства и эксплуатации.</p>
                    </div>
                    <div>
                        <p>© ТОО «Мунай Integration» Все права защищены.</p>
                        <p>Сделано в Homex®</p>
                    </div>
                </div>
            </div>
        </footer>
    )
}